Revit 2026 API

# BuiltInFailuresElementTypeFailures Class

---

Failures about ElementTypeFailures.

SystemObject Autodesk.Revit.DBBuiltInFailuresElementTypeFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ElementTypeFailures
```
```vb
Public NotInheritable Class ElementTypeFailures
```
```cpp
public ref class ElementTypeFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ElementTypeFailures = class end
```

The BuiltInFailuresElementTypeFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NoDefaultType | As a result of Reloading Latest, there are no types of [User Name] left. Create a new type by duplicating an existing [User Name] type in the Project Browser. |
|  | WarnLastType1 | Last type in system family '[Name]' cannot be deleted. |

#### Reference

Autodesk.Revit.DB Namespace